In [1]:
import pandas as pd 
import seaborn as sns

In [2]:
df = pd.read_csv("global_terror.csv", encoding="latin-1")

In [3]:
df

,eventid,iyear,imonth,iday,approxdate,extended,resolution,country,country_txt,region,...,addnotes,scite1,scite2,scite3,dbsource,INT_LOG,INT_IDEO,INT_MISC,INT_ANY,related
0,197000000001,1970,7,2,NaN,0,NaN,58,Dominican Republic,2,...,NaN,NaN,NaN,NaN,PGIS,0,0,0,0,NaN
1,197000000002,1970,0,0,NaN,0,NaN,130,Mexico,1,...,NaN,NaN,NaN,NaN,PGIS,0,1,1,1,NaN
2,197001000001,1970,1,0,NaN,0,NaN,160,Philippines,5,...,NaN,NaN,NaN,NaN,PGIS,-9,-9,1,1,NaN
3,197001000002,1970,1,0,NaN,0,NaN,78,Greece,8,...,NaN,NaN,NaN,NaN,PGIS,-9,-9,1,1,NaN
4,197001000003,1970,1,0,NaN,0,NaN,101,Japan,4,...,NaN,NaN,NaN,NaN,PGIS,-9,-9,1,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
181686,201712310022,2017,12,31,NaN,0,NaN,182,Somalia,11,...,NaN,"""Somalia: Al-Shabaab Militants Attack Army Che...","""Highlights: Somalia Daily Media Highlights 2 ...","""Highlights: Somalia Daily Media Highlights 1 ...",START Primary Collection,0,0,0,0,NaN
181687,201712310029,2017,12,31,NaN,0,NaN,200,Syria,10,...,NaN,"""Putin's 'victory' in Syria has turned into a ...","""Two Russian soldiers killed at Hmeymim base i...","""Two Russian servicemen killed in Syria mortar...",START Primary Collection,-9,-9,1,1,NaN
181688,201712310030,2017,12,31,NaN,0,NaN,160,Philippines,5,...,NaN,"""Maguindanao clashes trap tribe members,"" Phil...",NaN,NaN,START Primary Collection,0,0,0,0,NaN
181689,201712310031,2017,12,31,NaN,0,NaN,92,India,6,...,NaN,"""Trader escapes grenade attack in Imphal,"" Bus...",NaN,NaN,START Primary Collection,-9,-9,0,-9,NaN
181690,201712310032,2017,12,31,NaN,0,NaN,160,Philippines,5,...,NaN,"""Security tightened in Cotabato following IED ...","""Security tightened in Cotabato City,"" Manila ...",NaN,START Primary Collection,-9,-9,0,-9,NaN

In [4]:
df.columns

Index(['eventid', 'iyear', 'imonth', 'iday', 'approxdate', 'extended',
       'resolution', 'country', 'country_txt', 'region',
       ...
       'addnotes', 'scite1', 'scite2', 'scite3', 'dbsource', 'INT_LOG',
       'INT_IDEO', 'INT_MISC', 'INT_ANY', 'related'],
      dtype='object', length=135)

In [5]:
keep_columns =["iyear", "imonth", "iday", "country_txt", "region_txt","latitude","longitude"]

df= df[keep_columns]

In [6]:
df

,iyear,imonth,iday,country_txt,region_txt,latitude,longitude
0,1970,7,2,Dominican Republic,Central America & Caribbean,18.456792,-69.951164
1,1970,0,0,Mexico,North America,19.371887,-99.086624
2,1970,1,0,Philippines,Southeast Asia,15.478598,120.599741
3,1970,1,0,Greece,Western Europe,37.997490,23.762728
4,1970,1,0,Japan,East Asia,33.580412,130.396361
...,...,...,...,...,...,...,...
181686,2017,12,31,Somalia,Sub-Saharan Africa,2.359673,45.385034
181687,2017,12,31,Syria,Middle East & North Africa,35.407278,35.942679
181688,2017,12,31,Philippines,Southeast Asia,6.900742,124.437908
181689,2017,12,31,India,South Asia,24.798346,93.940430
181690,2017,12,31,Philippines,Southeast Asia,7.209594,124.241966

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181691 entries, 0 to 181690
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   iyear        181691 non-null  int64
 1   imonth       181691 non-null  int64
 2   iday         181691 non-null  int64
 3   country_txt  181691 non-null  object
 4   region_txt   181691 non-null  object
 5   latitude     177135 non-null  float64
 6   longitude    177134 non-null  float64
dtypes: float64(2), int64(3), object(2)
memory usage: 9.7+ MB

In [12]:
df_filter= df[df["country_txt"].isin(["Spain","Italy"])]
df_filter= df_filter[["iyear","country_txt"]]

gb = df_filter.groupby(["iyear","country_txt"])["country_txt"].count().to_frame()
gb.columns = ["count"]
gb.reset_index(inplace = True)
gb.T

,0,1,2,3,4,5,6,7,8,9,...,82,83,84,85,86,87,88,89,90,91
iyear,1970,1970,1971,1971,1972,1972,1973,1973,1974,1974,...,2013,2013,2014,2014,2015,2015,2016,2016,2017,2017
country_txt,Italy,Spain,Italy,Spain,Italy,Spain,Italy,Spain,Italy,Spain,...,Italy,Spain,Italy,Spain,Italy,Spain,Italy,Spain,Italy,Spain
count,3,4,3,22,4,19,15,21,22,14,...,7,5,7,4,5,1,11,3,8,4

In [13]:
df_filter

        iyear country_txt
12       1970       Italy
97       1970       Italy
103      1970       Spain
437      1970       Spain
569      1970       Italy
...       ...         ...
178017   2017       Spain
178018   2017       Spain
178048   2017       Spain
181113   2017       Italy
181682   2017       Italy

[4814 rows x 2 columns]